; domain
;; Transport sequential
;;

(define (domain transport)
(:requirements
:typing
:action-costs
)
(:types
location target locatable - object
vehicle package - locatable
capacity-number - object
)

(:predicates
(road ?l1 ?l2 - location)
(at ?x - locatable ?y - location)
(in ?x - package ?y - vehicle)
(capacity ?v - vehicle ?s1 - capacity-number)
(capacity-predecessor ?s1 ?s2 - capacity-number)
)

(:functions
(road-length ?l1 ?l2 - location) - number
(total-cost) - number
)

(:action drive
:parameters (?v - vehicle ?l1 ?l2 - location)
:precondition (and
(at ?v ?l1)
(road ?l1 ?l2)
)
:effect (and
(not (at ?v ?l1))
(at ?v ?l2)
(increase (total-cost) (road-length ?l1 ?l2))
)
)

(:action pick-up
:parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
:precondition (and
(at ?v ?l)
(at ?p ?l)
(capacity-predecessor ?s1 ?s2)
(capacity ?v ?s2)
)
:effect (and
(not (at ?p ?l))
(in ?p ?v)
(capacity ?v ?s1)
(not (capacity ?v ?s2))
(increase (total-cost) 1)
)
)

(:action drop
:parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
:precondition (and
(at ?v ?l)
(in ?p ?v)
(capacity-predecessor ?s1 ?s2)
(capacity ?v ?s1)
)
:effect (and
(not (in ?p ?v))
(at ?p ?l)
(capacity ?v ?s2)
(not (capacity ?v ?s1))
(increase (total-cost) 1)
)
)

)

; problem
; Transport city-sequential-5nodes-1000size-2degree-100mindistance-2trucks-2packages-2008seed

(define (problem transport-city-sequential-5nodes-1000size-2degree-100mindistance-2trucks-2packages-2008seed)
(:domain transport)
(:objects
city-loc-1 - location
city-loc-2 - location
city-loc-3 - location
city-loc-4 - location
city-loc-5 - location
truck-1 - vehicle
truck-2 - vehicle
package-1 - package
package-2 - package
capacity-0 - capacity-number
capacity-1 - capacity-number
capacity-2 - capacity-number
capacity-3 - capacity-number
capacity-4 - capacity-number
)
(:init
(= (total-cost) 0)
(capacity-predecessor capacity-0 capacity-1)
(capacity-predecessor capacity-1 capacity-2)
(capacity-predecessor capacity-2 capacity-3)
(capacity-predecessor capacity-3 capacity-4)
; 456,221 -> 273,425
(road city-loc-1 city-loc-4)
(= (road-length city-loc-1 city-loc-4) 28)
; 456,221 -> 566,552
(road city-loc-1 city-loc-5)
(= (road-length city-loc-1 city-loc-5) 35)
; 742,542 -> 564,783
(road city-loc-2 city-loc-3)
(= (road-length city-loc-2 city-loc-3) 30)
; 742,542 -> 566,552
(road city-loc-2 city-loc-5)
(= (road-length city-loc-2 city-loc-5) 18)
; 564,783 -> 742,542
(road city-loc-3 city-loc-2)
(= (road-length city-loc-3 city-loc-2) 30)
; 564,783 -> 566,552
(road city-loc-3 city-loc-5)
(= (road-length city-loc-3 city-loc-5) 24)
; 273,425 -> 456,221
(road city-loc-4 city-loc-1)
(= (road-length city-loc-4 city-loc-1) 28)
; 273,425 -> 566,552
(road city-loc-4 city-loc-5)
(= (road-length city-loc-4 city-loc-5) 32)
; 566,552 -> 456,221
(road city-loc-5 city-loc-1)
(= (road-length city-loc-5 city-loc-1) 35)
; 566,552 -> 742,542
(road city-loc-5 city-loc-2)
(= (road-length city-loc-5 city-loc-2) 18)
; 566,552 -> 564,783
(road city-loc-5 city-loc-3)
(= (road-length city-loc-5 city-loc-3) 24)
; 566,552 -> 273,425
(road city-loc-5 city-loc-4)
(= (road-length city-loc-5 city-loc-4) 32)
(at package-1 city-loc-4)
(at package-2 city-loc-4)
(at truck-1 city-loc-4)
(capacity truck-1 capacity-2)
(at truck-2 city-loc-5)
(capacity truck-2 capacity-4)
)
(:goal (and
(at package-1 city-loc-5)
(at package-2 city-loc-2)
))
(:metric minimize (total-cost))
)

; plan
1. (pick-up truck-1 city-loc-4 package-1 capacity-1 capacity-2)
   deleted: (at package-1 city-loc-4) (capacity truck-1 capacity-2)
   added: (in package-1 truck-1) (capacity truck-1 capacity-1)
   goals met: 0 of 2
2. (pick-up truck-1 city-loc-4 package-2 capacity-0 capacity-1)
   deleted: (at package-2 city-loc-4) (capacity truck-1 capacity-1)
   added: (in package-2 truck-1) (capacity truck-1 capacity-0)
   goals met: 0 of 2
3. (drive truck-1 city-loc-4 city-loc-5)
   deleted: (at truck-1 city-loc-4)
   added: (at truck-1 city-loc-5)
   goals met: 0 of 2
4. (drop truck-1 city-loc-5 package-1 capacity-0 capacity-1)
   deleted: (in package-1 truck-1) (capacity truck-1 capacity-0)
   added: (at package-1 city-loc-5) (capacity truck-1 capacity-1)
   goals met: 1 of 2
5. (drive truck-1 city-loc-5 city-loc-2)
   deleted: (at truck-1 city-loc-5)
   added: (at truck-1 city-loc-2)
   goals met: 1 of 2
6. (drop truck-1 city-loc-2 package-2 capacity-1 capacity-2)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-1)
   added: (at package-2 city-loc-2) (capacity truck-1 capacity-2)
   goals met: 2 of 2
